In [1]:
import sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

## List all the tables

In [ ]:
connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

def tables_in_sqlite_db(conn):
    cursor = conn.execute("SELECT name FROM sqlite_master WHERE type='table';")
    tables = [
        v[0] for v in cursor.fetchall()
        if v[0] != "sqlite_sequence"
    ]
    cursor.close()
    return tables

tables = tables_in_sqlite_db(connection)
for i in tables:
    print(i)

In [30]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = ("Select * from SP500_companies ")
df = pd.read_sql_query(sql,connection)

In [82]:
df[df.Symbol == "HSIC"]

               Company Symbol    Weight
449  Henry Schein Inc.   HSIC  0.032787

In [62]:
df[193:]

                               Company Symbol      Weight
193     Marathon Petroleum Corporation    MPC    0.110018
194  Microchip Technology Incorporated   MCHP    0.109975
195       Alexion Pharmaceuticals Inc.   ALXN    0.109500
196                  MSCI Inc. Class A   MSCI    0.109434
197                          eBay Inc.   EBAY    0.109125
..                                 ...    ...         ...
503          Under Armour Inc. Class A    UAA    0.011972
504          Under Armour Inc. Class C     UA    0.010361
505           News Corporation Class B    NWS    0.008590
506                            S&P 500  ^GSPC  100.000000
507       Dow Jones Industrial Average   ^DJI  100.000000

[315 rows x 3 columns]

In [28]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = (''' select * from prices 
where date == "2021-05-19 00:00:00"

''')
price = pd.read_sql_query(sql,connection)
print(price.shape)
price.head()

(2, 8)

,date,open,high,low,close,adj_close,volume,symbol
0,2021-05-19 00:00:00,123.16,124.92,122.86,124.69,124.69,"92,499,900",AAPL
1,2021-05-19 00:00:00,239.31,243.23,238.60,243.12,243.12,"25,723,300",MSFT

price

In [15]:
price[price.open == "Stock Split"]

Empty DataFrame
Columns: [date, open, high, low, close, adj_close, volume, symbol]
Index: []

In [14]:
price[price.open == "Dividend"]

Empty DataFrame
Columns: [date, open, high, low, close, adj_close, volume, symbol]
Index: []

In [84]:
## Delete

connection = sqlite3.connect('MSC.db') 
cursor = connection.cursor() 
sql = ("delete from prices where open = 'Dividend'") 
cursor.execute(sql) 
connection.commit()

In [4]:
## Duplicates

connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = ('''select symbol, date, XX as count, AM 
from (Select symbol, date, COUNT(symbol) OVER(PARTITION BY symbol, date) as XX ,ROW_NUMBER() OVER(PARTITION BY symbol, date) as AM from prices) where XX > 1''')
df = pd.read_sql_query(sql,connection)
print(df.shape)
df.head()

(10, 4)

  symbol                 date  count  AM
0    KHC  2021-05-19 00:00:00      2   1
1    KHC  2021-05-19 00:00:00      2   2
2    KSU  2021-05-19 00:00:00      2   1
3    KSU  2021-05-19 00:00:00      2   2
4    LYB  2021-05-19 00:00:00      2   1

In [25]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = (''' select date(date), * from prices 
where symbol = "AAPL"
order by date desc

''')
price = pd.read_sql_query(sql,connection)
print(price.shape)
price.head()

(101, 9)

,date(date),date,open,high,low,close,adj_close,volume,symbol
0,2021-05-19,2021-05-19 00:00:00,123.16,124.92,122.86,124.69,124.69,"92,499,900",AAPL
1,2021-05-18,2021-05-18 00:00:00,126.56,126.99,124.78,124.85,124.85,"63,130,600",AAPL
2,2021-05-17,2021-05-17 00:00:00,126.82,126.93,125.17,126.27,126.27,"74,163,100",AAPL
3,2021-05-14,2021-05-14 00:00:00,126.25,127.89,125.85,127.45,127.45,"81,806,500",AAPL
4,2021-05-13,2021-05-13 00:00:00,124.58,126.15,124.26,124.97,124.97,"105,861,300",AAPL

## DF to SQL 

connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
df_distinct.to_sql('prices', connection, index = False)
connection.commit()
connection.close()

In [ ]:
connection = sqlite3.connect('MSC.db')
cursor = connection.cursor()
sql = ("Select symbol from SP500_companies where symbol not in (select distinct symbol from prices where date == '2021-05-17 00:00:00')")
df = pd.read_sql_query(sql,connection)
df

## Drop table

#https://www.sqlite.org/datatype3.html
cursor.executescript("DROP TABLE IF EXISTS prices")

In [ ]:
connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

sql = ('Select date(moment) as date, * from ER20202021')
z =pd.read_sql_query(sql,connection)
z.shape

## Alter

connection = sqlite3.connect("MSC.db")
cursor = connection.cursor()

sql = ('ALTER TABLE top30 RENAME COLUMN date TO Date')
pd.read_sql_query(sql,connection)

In [ ]:
#Transfer to main folder
import shutil
newPath = shutil.copy('MSC.db', '/Users/Edite')